In [1]:
# Import the required modules
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Read the dataset and assign to a dataframe dfa. 
# Check the count of records in the dataframe.  
dfa=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=None)
print(dfa.head(3))
print('\nThe number of records in the dataframe dfa is : ', dfa[0].count())

   0                  1       2           3   4                    5   \
0  39          State-gov   77516   Bachelors  13        Never-married
1  50   Self-emp-not-inc   83311   Bachelors  13   Married-civ-spouse
2  38            Private  215646     HS-grad   9             Divorced

                   6               7       8      9     10  11  12  \
0        Adm-clerical   Not-in-family   White   Male  2174   0  40
1     Exec-managerial         Husband   White   Male     0   0  13
2   Handlers-cleaners   Not-in-family   White   Male     0   0  40

               13      14
0   United-States   <=50K
1   United-States   <=50K
2   United-States   <=50K

The number of records in the dataframe dfa is :  32561

In [3]:
# Create a sample dataframe dfb - fraction 0.1 is used to get the sample size.
dfb=dfa.sample(frac=0.1)
print('The number of records in the sample dataframe is : ', dfb[0].count())

The number of records in the sample dataframe is :  3256

In [4]:
# Rename the columns in the dataframe 
dfb.columns=['age', 'workclass', 'fnlwgt','education','education-num','marital-status','occupation',
             'relationship','race','sex','capital-gain','capital-loss', 'hours-per-week',
                   'native-country','grossincome']

In [5]:
# Create a sqlite3 database using SQLAlchemy. Name it sqladb1.
engine = create_engine('sqlite://', echo=False)
dfb.to_sql('sqladb1',con=engine)

In [6]:
# First Update Query - Update the workclass with ' ?' as ' Unknown' 
result1=engine.execute('SELECT DISTINCT workclass FROM sqladb1;').fetchall()
print('Values of workclass before update \n', '*'*31)
print(result1)
# Update the workclass values
engine.execute('UPDATE sqladb1 SET workclass = " Unknown" WHERE workclass = " ?";')
# Show the value is updated. 
resulta1=engine.execute('SELECT DISTINCT workclass FROM sqladb1;').fetchall()
print('Values of workclass after update \n', '*'*31)
print(resulta1)

Values of workclass before update
 *******************************
[(' Private',), (' Local-gov',), (' ?',), (' Self-emp-not-inc',), (' State-gov',), (' Self-emp-inc',), (' Federal-gov',)]
Values of workclass after update
 *******************************
[(' Private',), (' Local-gov',), (' Unknown',), (' Self-emp-not-inc',), (' State-gov',), (' Self-emp-inc',), (' Federal-gov',)]

In [7]:
# Second Update Query - Update the occupation with ' ?' as ' Unknown' 
result2=engine.execute('SELECT DISTINCT occupation FROM sqladb1;').fetchall()
print('Values of occupation before update \n', '*'*33)
print(result2)
# Update the workclass values
engine.execute('UPDATE sqladb1 SET occupation = " Unknown" WHERE occupation = " ?";')
# Show the value is updated. 
resulta2=engine.execute('SELECT DISTINCT occupation FROM sqladb1;').fetchall()
print('\nValues of occupation after update \n', '*'*33)
print(resulta2)

Values of occupation before update
 *********************************
[(' Adm-clerical',), (' Exec-managerial',), (' Prof-specialty',), (' ?',), (' Craft-repair',), (' Other-service',), (' Farming-fishing',), (' Protective-serv',), (' Machine-op-inspct',), (' Transport-moving',), (' Sales',), (' Handlers-cleaners',), (' Tech-support',), (' Priv-house-serv',)]

Values of occupation after update
 *********************************
[(' Adm-clerical',), (' Exec-managerial',), (' Prof-specialty',), (' Unknown',), (' Craft-repair',), (' Other-service',), (' Farming-fishing',), (' Protective-serv',), (' Machine-op-inspct',), (' Transport-moving',), (' Sales',), (' Handlers-cleaners',), (' Tech-support',), (' Priv-house-serv',)]

In [8]:
# First Delete Query - Delete details of people of age 90 in the table.
result3=engine.execute('SELECT COUNT(*) FROM sqladb1 WHERE age=90;').fetchall()
print('Number of people with age 90 before delete :', result3[0][0])
# Delete the records with people of age 90
engine.execute('DELETE FROM sqladb1 WHERE age=90;')
result3a=engine.execute('SELECT COUNT(*) FROM sqladb1 WHERE age=90;').fetchall()
print('Number of people with age 90 after delete :', result3a[0][0])

Number of people with age 90 before delete : 6
Number of people with age 90 after delete : 0

In [9]:
# Second Delete Query - Delete data from the table with country as India and work class as Private or Self-emp-inc
result4=engine.execute('SELECT * FROM sqladb1 WHERE "native-country" = " India";').fetchall()
print('Data in the table before delete \n', '*'*28)
print(result4)
# Delete the data 
engine.execute('DELETE FROM sqladb1 WHERE "native-country" = " India" and workclass IN (" Private", " Self-emp-inc");')
# Show the data after delete
result4a=engine.execute('SELECT * FROM sqladb1 WHERE "native-country" = " India";').fetchall()
print('\nData in the table after delete \n', '*'*28)
result4a

Data in the table before delete
 ****************************
[(6219, 46, ' Private', 175262, ' Assoc-acdm', 12, ' Married-civ-spouse', ' Adm-clerical', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' <=50K'), (2558, 58, ' State-gov', 110517, ' Doctorate', 16, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 4064, 0, 40, ' India', ' <=50K'), (4523, 57, ' Local-gov', 148509, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 35, ' India', ' <=50K'), (7844, 35, ' Private', 107302, ' Masters', 14, ' Married-civ-spouse', ' Sales', ' Husband', ' White', ' Male', 0, 0, 40, ' India', ' <=50K'), (28693, 32, ' Private', 137367, ' 11th', 7, ' Never-married', ' Craft-repair', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' <=50K'), (16923, 41, ' Private', 143003, ' Assoc-voc', 11, ' Married-civ-spouse', ' Other-service', ' Husband', ' Asian-Pac-Islander', ' Male', 7298, 0, 60, ' India', ' >50K'), (21128, 30, ' Private', 122889, ' Masters', 14, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 50, ' India', ' >50K'), (11260, 54, ' Private', 225599, ' Masters', 14, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 7298, 0, 40, ' India', ' >50K'), (27670, 61, ' Private', 80896, ' Masters', 14, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 45, ' India', ' >50K'), (26356, 34, ' Private', 99872, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' Asian-Pac-Islander', ' Male', 3103, 0, 40, ' India', ' >50K'), (29207, 25, ' Local-gov', 124483, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 20, ' India', ' <=50K'), (11384, 34, ' Private', 98283, ' Prof-school', 15, ' Never-married', ' Tech-support', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 1564, 40, ' India', ' >50K'), (9128, 18, ' Self-emp-inc', 119422, ' HS-grad', 9, ' Never-married', ' Other-service', ' Unmarried', ' Asian-Pac-Islander', ' Female', 0, 0, 30, ' India', ' <=50K'), (16336, 47, ' Private', 191411, ' Masters', 14, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 45, ' India', ' <=50K')]

Data in the table after delete
 ****************************

[(2558, 58, ' State-gov', 110517, ' Doctorate', 16, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 4064, 0, 40, ' India', ' <=50K'),
 (4523, 57, ' Local-gov', 148509, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 35, ' India', ' <=50K'),
 (29207, 25, ' Local-gov', 124483, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 20, ' India', ' <=50K')]

In [10]:
# First Filter Query - Select data from the table with country as Thailand
print('Data for Thailand \n', '*'*15)
engine.execute('SELECT * FROM sqladb1 WHERE "native-country" = " Thailand";').fetchall()

Data for Thailand
 ***************

[(24202, 29, ' State-gov', 67053, ' HS-grad', 9, ' Never-married', ' Other-service', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' Thailand', ' <=50K'),
 (21452, 45, ' Self-emp-not-inc', 182677, ' HS-grad', 9, ' Married-spouse-absent', ' Craft-repair', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' Thailand', ' <=50K')]

In [11]:
# Second Filter Query - Select data from the table for Italy with age greater than 40 
print('Data for Italy with  age greater than 40 \n', '*'*50)
engine.execute('SELECT * FROM sqladb1 WHERE "native-country" = " Italy" and age > 40;').fetchall()

Data for Italy with  age greater than 40
 **************************************************

[(28008, 42, ' Private', 202565, ' 1st-4th', 2, ' Married-civ-spouse', ' Machine-op-inspct', ' Husband', ' White', ' Male', 0, 0, 40, ' Italy', ' <=50K'),
 (31247, 53, ' Unknown', 155233, ' 12th', 8, ' Married-civ-spouse', ' Unknown', ' Wife', ' White', ' Female', 0, 0, 40, ' Italy', ' <=50K'),
 (16699, 50, ' Self-emp-inc', 123429, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' White', ' Male', 0, 0, 45, ' Italy', ' >50K'),
 (18443, 43, ' Private', 144778, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' White', ' Male', 0, 0, 55, ' Italy', ' >50K')]

In [12]:
"""First function Query - Get the count of records from the table for United States and maximum value of 
   capital gain for United States"""
q1="""SELECT COUNT(*), MAX("capital-gain") FROM sqladb1 WHERE "native-country" = " United-States" 
                GROUP BY 'capital-gain'"""
result5=engine.execute(q1).fetchall()
print('Number of records for United States : ', result5[0][0])
print('Maximum capital gain for United States : ', result5[0][1])

Number of records for United States :  2916
Maximum capital gain for United States :  99999

In [13]:
# Second Function query to get Minimum, Maximum and Average finalweight values in the database. 
result6=engine.execute('SELECT MIN(fnlwgt), MAX(fnlwgt), AVG(fnlwgt) FROM sqladb1;').fetchall()
print('Minimum finalweight value in the database : ', result6[0][0])
print('Maximum finalweight value in the database : ', result6[0][1])
print('Average finalweight value in the database : ', result6[0][2])

Minimum finalweight value in the database :  19914
Maximum finalweight value in the database :  1366120
Average finalweight value in the database :  189388.01605433776

In [14]:
engine.dispose()